Repository: steam3d/MagicSelectUI-Windows-Strings
Catalog: */Resources.resw
Source language: en_us
Languages: ar_aa, cs_cz, de_de, es_es, hi_in, ko_kr, pl_pl, pt_br, ur_pk, vi_vn, zh_hans

# Settings_Translation_Setting_From_Item_KeyboardLayout.Text
source: Same as keyboard layout
ar_aa: نفس تخطيط لوحة المفاتيح
cs_cz: Stejný jako rozložení klávesnice
de_de: Gleiches Layout wie bei der Tastatur
es_es: Igual que la distribución del teclado
hi_in: कीबोर्ड लेआउट के समान
ko_kr: 키보드 레이아웃과 같음
pl_pl: Taki sam jak układ klawiatury
pt_br: Mesmo do teclado
vi_vn: Giống với bố cục bàn phím

# Settings_Hotkeys_Setting_SelectToClipboard.Header
source: Recognize text and copy to clipboard
ar_aa: التعرف على النص ونسخه إلى الحافظة
cs_cz: Rozpoznat text a zkopírovat do schránky
de_de: Erkennen von Text und Kopieren in die Zwischenablage
es_es: Reconocer texto y copiarlo al portapapeles
hi_in: पाठ को पहचानें और क्लिपबोर्ड पर कॉपी
ko_kr: 텍스트를 식별하고 복사하기
pl_pl: Rozpoznaj tekst i skopiuj do schowka
pt_br: Reconhecer texto e copiar para a área de transferência
vi_vn: Nhận diện văn bản và sao chép vào bộ nhớ đệm

# Settings_About_MagicPods.ToolTipService.ToolTip
source: Add a little magic to your AirPods
ar_aa: أضف القليل من السحر إلى سماعات AirPods الخاصة بك
cs_cz: Přidejte svým AirPodům trochu magie
de_de: Verleihe deinen AirPods ein wenig Magie
es_es: Añade un poco de magia a tus AirPods
hi_in: अपने एयरपॉड्स में थोड़ा जादू जोड़ें
ko_kr: AirPods에 마법을 더해보세요
pl_pl: Dodaj odrobinę magii do swoich AirPods'ów
pt_br: Adicione um pouco de magia aos seus AirPods
vi_vn: Thêm một chút phép thuật vào AirPods của bạn

# Settings_AppSettings_Setting_ResetSettings_Button_Reset.Content
source: Reset
ar_aa: إعادة الضبط
cs_cz: Resetovat
de_de: Zurücksetzen
es_es: Reiniciar
hi_in: रीसेट करें
ko_kr: 초기화
pl_pl: Przywróć
pt_br: Restaurar
vi_vn: Khôi phục

# Settings_AppSettings_ContentDialogStartup.Content
source: Open Windows settings on Application page, go to Startup, enable «MagicSelect Hotkeys» and restart the app.
ar_aa: افتح إعدادات ويندوز على صفحة التطبيق، وانتقل إلى بدء التشغيل، وقم بتمكين «MagicSelect Hotkeys» وأعد تشغيل التطبيق.
cs_cz: Otevřete nastavení systému Windows na stránce Aplikace, přejděte do nabídky Po spuštění, povolte klávesové zkratky „MagicSelect“ a restartujte aplikaci.
de_de: Öffnen Sie die Windows-Einstellungen auf der Anwendungsseite, gehen Sie zu Startup, aktivieren Sie "MagicSelect Hotkeys" und starten Sie die Anwendung neu.
es_es: Abra la configuración de Windows en la página de la aplicación, vaya a Inicio, habilite «MagicSelect Teclas de acceso rápido» y reinicie la aplicación.
ko_kr: 애플리케이션 창에서 Windows 설정을 연 뒤, «시작 프로그램»에 들어가, «MagicSelect 단축키»를 활성화한 뒤 앱을 재시작하세요.
pl_pl: Otwórz ustawienia systemu Windows, przejdź do zakładki "Aplikacje", przejdź do "Uruchamianie", włącz "MagicSelect Hotkeys" i uruchom ponownie aplikację.
pt_br: Abra as configurações do Windows na página Aplicativo, vá para Inicialização, ative «MagicSelect Hotkeys» e reinicie o aplicativo.
ur_pk: ایپلیکیشن پیج پر ونڈوز سیٹنگز کھولیں، اسٹارٹ اپ پر جائیں، «Magic Select Hotkeys» کو فعال کریں اور ایپ کو دوبارہ شروع کریں۔
vi_vn: Mở phần cài đặt Windows trên trang Ứng dụng, tới Khởi động cùng Windows, bật «MagicSelect Hotkeys» và khởi động lại ứng dụng.
zh_hans: 打开应用程序页面上的Windows设置.进入启动.启用«MagicSelect热键»并重新启动应用程序.

# DropFiles_Button_CopyText.[using:Windows.UI.Xaml.Controls]ToolTipService.ToolTip
source: Copy text
ur_pk: متن کاپی کریں
zh_hans: 复制文本

source: Remove line breaks
ur_pk: لائن بریکس کو ہٹا دیں
zh_hans: 删除换行符

source: Re-recognize text
ur_pk: متن کو دوبارہ پہچانیں
zh_hans: 重新识别文本

# Settings_AppSettings_Theme.Text
source: Theme
ur_pk: خیالیہ
zh_hans: 主题

# Settings_AppSettings_Theme.Header
source: Application settings
ur_pk: اپلیکیشن کی ترتیبات
zh_hans: 应用程序设置

# Settings_AppSettings_Language.Text
source: Language
ur_pk: زبان
zh_hans: 语言

# Settings_Recognition_Language.Header
source: Recognition
ur_pk: پہچان
zh_hans: 识别

# Settings_Recognition_Language.Text
source: Language
ur_pk: زبان
zh_hans: 语言

# Settings_Translation_From.Header
source: Translation
ur_pk: ترجمہ
zh_hans: 翻译

# Settings_Translation_From_Item_KeyboardLayout.Text
source: Same as keyboard layout
ur_pk: کی بورڈ لے آؤٹ کی طرح
zh_hans: 与键盘布局相同

# Settings_Translation_To.Text
source: Translate to language
ur_pk: زبان میں ترجمہ کریں
zh_hans: 翻译到(语言)

# Settings_Translation_To_Item_SystemLanguage.Text
source: Use system language
ur_pk: سسٹم کی زبان استعمال کریں
zh_hans: 使用系统语言

# Settings_Hotkeys_EnableHotkeys.Header
source: Hotkeys
ur_pk: ہاٹکیز
zh_hans: 快捷键

# Settings_Hotkeys_EnableHotkeys.Text
source: Enable hotkeys
ur_pk: ہاٹکیز کو فعال کریں
zh_hans: 启用热键

# Settings_Hotkeys_SelectToClipboard.Text
source: Select text and copy to clipboard
ur_pk: متن کو پہچانیں اور کلپ بورڈ پر کاپی کریں
zh_hans: 识别文本并复制到剪贴板

# Settings_Hotkeys_SelectToTranslate.Text
source: Select text and translate
ur_pk: متن کو پہچانیں اور ترجمہ کریں
zh_hans: 识别文本并翻译

# HotkeyBox_Input.PlaceholderText
source: Type a hotkey
ur_pk: ہاٹکی ٹائپ کریں
zh_hans: 键入热键

# HotkeyBox_Input.ToolTipService.ToolTip
source: Include Win, Shift, Alt or Ctrl key
ur_pk: Win، Shift، Alt یا Ctrl کلید شامل کریں
zh_hans: 包括Win、Shift、Alt或Ctrl键

# HotkeyBox_Button_Remove.ToolTipService.ToolTip
source: Remove hotkey
ur_pk: ہاٹکی کو ہٹا دیں
zh_hans: 删除热键

# Settings_Translation_From.Text
source: Translate from language
ur_pk: زبان سے ترجمہ کریں
zh_hans: 从语言翻译

# Settings_AppSettings_Language_Item_SystemLanguage.Text
source: Use system language
ur_pk: سسٹم کی زبان استعمال کریں
zh_hans: 使用系统语言

source: Zoom image
ur_pk: تصویر کو زوم کریں
zh_hans: 缩放图像

# Settings_AppSettings_DebugLog.Text
source: Debug log
ur_pk: ڈیبگ لاگ
zh_hans: 调试日志

# Settings_AppSettings_ResetSettings_Button_Reset.Content
source: Reset
ur_pk: دوبارہ ترتیب دیں
zh_hans: 重置

# CommandBar_Button_TakeScreenshoot.Label
source: Take screenshoot
ur_pk: اسکرین کی تصویر لیں
zh_hans: 截图

source: Choose text language
ur_pk: متن کی زبان کا انتخاب کریں
zh_hans: 选择文本语言

# DropFiles_Error_MaxDimension
source: Image dimensions ({0}x{1}) are too big for text recognition. Max image dimension is {2}.
ur_pk: تصویر کے طول و عرض ({0}x{1}) متن کی شناخت کے لیے بہت بڑے ہیں۔ تصویر کی زیادہ سے زیادہ جہت {2} ہے۔
zh_hans: 图像尺寸过大 ({0}x{1}) ,无法进行文本识别.可识别的最大尺寸为 {2}.

# GetScreenCapture_TimeOut_Error
source: The captured application appears to be minimized. Expand the app and try to take the screenshot again.
ur_pk: کیپچر کی گئی ایپلیکیشن کم سے کم دکھائی دیتی ہے۔ ایپ کو پھیلائیں اور دوبارہ اسکرین شاٹ لینے کی کوشش کریں۔
zh_hans: 捕获的应用程序似乎已最小化.展开应用程序并再次尝试截图.

source: Select text from image
ur_pk: تصویر پر متن منتخب کریں
zh_hans: 选择图像上的文本

# Settings_Recognition_Language_Item_KeyboardLayout.Text
source: Same as keyboard layout
ur_pk: کی بورڈ لے آؤٹ کی طرح
zh_hans: 与键盘布局相同

# Settings_Hotkeys_SelectToEdit.Text
source: Select text and open in editor
ur_pk: متن کو پہچانیں اور ایڈیٹر میں کھولیں
zh_hans: 识别文本并在编辑器中打开

# Settings_AppSettings_ResetSettings.Text
source: Reset to default settings
ur_pk: ڈیفالٹ سیٹنگز پر ری سیٹ کریں
zh_hans: 重置为默认设置
